cd D:\data\statadata

********************************************************************************
************************ Chapter 4 *********************************************
********************************************************************************


***** C3 *****
use HPRICE1,clear
reg lprice sqrft bdrms
* 上述回归得到的模型为 log(price)^hat = 4.766 + 0.0003794 * sqrft +  0.0288844 *  bdrms
*                                      (0.097)   (0.0296)            (0.0000432)
*  样本观测数n=88，R-squared = 0.5883.
* （1）估计值 theta_1^hat = 150 * beta_1^hat + beta_2^hat = 150*0.0003794 + 0.0288844 = 0.0857944 . 
*   说明在住房增加一个150平方英尺的卧室的情况下，预期价格将上涨约 8.6% .

* （2） beta_2 = theta_1 - 150* beta_1 ,带入模型得到：
* log(price) = beta_0 + beta_1 * sqrft + (theta_1 - 150* beta_1) *  bdrms + u
*            = beta_0 + beta_1 * (sqrf - 150 * bdrms) + theta_1 * bdrms + u .

gen new_sqrft=sqrft-150*bdrms
reg lprice new_sqrft bdrms 
* (3)根据(2)中模型的回归结果，theta_1^hat 的标准误为 0.0268 .
* 由于theta_1^hat = 0.0858, 因此95% 的置信区间为 （0.0326, 0.1390）.