cd D:\data\statadata

********************************************************************************
************************ Chapter 6 *********************************************
********************************************************************************

***** C1 *****
use KIELMC,clear
keep if year==1981  // 仅保留1981年的数据
*(1) 因为焚化炉的出现会使住房价格下降，故预期beta_1 ≥ 0. 
* 即在其他条件不变的情况下，住房离焚化炉越远，住房价格越高.
reg lprice ldist
* 估计得到的方程为 log(price) ^hat = 8.047 + 0.365 * log(dist)
*                                   (0.646)  (0.066)
*                  n = 142, R-squared = 0.180, Adjusted-R-squared = 0.174 . 
* 回归方程表明，住房离焚化炉的距离每增加1%，住房价格增加0.365% .

reg lprice ldist lintst larea lland rooms baths age
*(2) 在简单回归模型中增加变量log(inst),log(area),log(land(,rooms,baths和age后，
*    log(dist)的系数变为0.055，标准差为0.058，其对住房价格的影响减小了.
*    此时T统计量为0.96，统计上也不显著.
*    因为此时模型控制了其他关于房屋质量和位置（与州级公路之间的距离等）的变量，
*    使得住房到焚化炉的距离对住房价格的影响弱化了. 这一结果与焚化炉通常建造在位置
*    和质量相对较差的地区附近是吻合的.

reg lprice ldist lintst larea lland rooms baths age lintstsq
*(3) 向第(2)部分的模型中加入[log(intst)]^2 , 得到的回归模型为（只汇报了部分关键的解释变量）：
*  log(price) = -3.317 + 0.185 * log(dist) + 2.073 * log(intst) - 0.119 * [log(intst)]^2 + ...
*              (2.646)   (0.062)             (0.501)              (0.028)
*    n = 142, R-squared = 0.778, Adjusted-R-squared = 0.764 .
* log(dist)系数现在非常显著，T统计量为2.983 . 
* log(intst) 和[log(intst)]^2的系数也是显著的，T统计量绝对值大于4 .
* 添加[log(intst)]^2对所关心的变量log(dist)有较大的影响. 这表明离焚化炉的距离和离州际公路的距离
* 以非线性模型（二次）影响着住房价格. 可以计算出二次曲线的转折点为：
* - 2.073/(-2 * 0.119) = 8.69.
* 对其取幂运算得到离州级公路的距离为5943英尺. 
* 由于抛物线开口向下，因此，让住房距离州际公路的最恰当距离是5943英尺.
* 在此之前，离州际公路越远，预计房价会越高，而超过此距离后，预计房价就会降低.

gen ldistsq = ldist^2
reg lprice ldist lintst larea lland rooms baths age lintstsq ldistsq
*(4) 当向第(3)部分的模型中加入[log(dist)]^2时，[log(dist)]^2的系数为 -0.037，标准差为0.110.
* 从而T统计量为-0.33, 因此不显著，不应该在模型中加入此变量.





